[
  {
    "id": "issue-manager",
    "title": "Issue Manager (FSM-based)",
    "timeframe": "Jan 2024 – Apr 2024",
    "summary": "Java bug management system using finite state machines for assignment, completion, and reporting.",
    "outcome": "95% code coverage with 30+ unit/integration tests; 40% code complexity reduction using OOP patterns.",
    "stack": ["Java", "JUnit", "OOP", "FSM"],
    "image": "",
    "links": {
      "demo": "#",
      "repo": "#"
    },
    "highlights": [
      "Modeled bug lifecycle via FSM for predictable transitions and reporting",
      "CSV-based persistence for cross-session history tracking",
      "Wrote 30+ tests and simplified polymorphism/enum usage to shrink complexity"
    ],
    "lessons": [
      "Explicit state machines make business rules auditable",
      "Tests are cheaper than retrofits—coverage held refactors steady"
    ],
    "hidden": true
  },
  {
    "id": "reflectra",
    "title": "Reflectra – AI Wellness Copilot",
    "timeframe": "Feb 2025 · 36-hour hackathon",
    "summary": "AI reflection chat that turns your browsing history into balanced wellness insights instead of just screen-time metrics.",
    "outcome": "Built a Chrome extension + Supabase + RAG stack that highlights focus patterns and mindful breaks directly from tab activity.",
    "stack": ["Chrome Extension (MV3)", "Express", "Supabase", "GPT-4o-mini", "Pinecone", "React"],
    "image": "",
    "links": {
      "demo": "#",
      "repo": "#"
    },
    "highlights": [
      "Ships an AI Reflection Chat powered by RAG over your personal browsing embeddings",
      "Uses Pinecone to store per-site embeddings for context-rich recall of habits and focus trends",
      "Dashboards tab activity to surface when you start passive scrolling vs. deep work stretches",
      "Built and iterated the full stack in 36 hours with a team of three"
    ],
    "lessons": [
      "Wellness insights beat raw screen-time; context matters more than minutes watched",
      "Vector databases unlock personalized recall without storing raw histories",
      "Shipping fast still needs observability—tracked extension events to keep the RAG answers reliable"
    ]
  },
  {
    "id": "stock-sentiment",
    "title": "Stock Sentiment Analyzer",
    "timeframe": "Sep 2024 – Dec 2024",
    "summary": "FastAPI service that merges finance/news sources and applies NLP sentiment for real-time portfolio insights.",
    "outcome": "Selected FinBERT for 92% test accuracy versus Vader; delivers live sentiment on user portfolios.",
    "stack": ["Python", "FastAPI", "HuggingFace", "FinBERT", "PostgreSQL"],
    "image": "",
    "links": {
      "demo": "#",
      "repo": "#"
    },
    "highlights": [
      "Aggregated Reddit, Yahoo Finance, and NewsAPI feeds before sentiment scoring",
      "Benchmarked FinBERT vs Vader and productionized the higher-accuracy model",
      "Built end-to-end ML pipeline with user portfolios and live updates"
    ],
    "lessons": [
      "Model choice must be tied to data freshness—FinBERT wins on finance corpora",
      "Input cleanliness (dedup, spam filtering) moves the accuracy needle most"
    ]
  },
  {
    "id": "mood-music",
    "title": "Mood-Based Music Recommendation",
    "timeframe": "Jun 2024 – Aug 2024",
    "summary": "React + Node app that predicts mood from text and serves personalized songs via Spotify API.",
    "outcome": "~90% mood detection accuracy and secure auth with bcrypt hashing and session management.",
    "stack": ["React", "Node.js", "Express", "NLP", "Spotify API"],
    "image": "",
    "links": {
      "demo": "#",
      "repo": "#"
    },
    "highlights": [
      "Full-stack app with React front-end and Node/Express backend",
      "Integrated Spotify API to stream 5 personalized songs per query",
      "Implemented REST API integration plus auth using bcrypt hashing"
    ],
    "lessons": [
      "Latency budgets matter when chaining third-party APIs",
      "Keep auth surfaces small—hash and salt everything, and scope tokens"
    ]
  }
]
